#include <stdio.h>
int main(){
    /*
    二维数组的实质：连续的内存空间
    二维数组的定义：数据类型 数组名 [常量表达式][常量表达式]
    */

    //二维数组的初始化：
    //方式一：完全赋值
    int arr1[3][4]={
        {1,2,3,4},
        {5,6,7,8},
        {9,10,11,12}
    };
    //方式二：赋值全部元素，不填行数、列数，由系统自动分组
    int arr2[2][2]={1,2,3,4};
    //方式三：部分赋值
    int arr3[3][4]={
        {1},
        {5},
        {9}
    };
    //方式四：提供行数、列数，全部填充0
    int arr4[3][4]={0};
    //方式五：赋值全部元素，只填列数，由系统自动分组
    int arr5[][4]={1,2,3,4,5,6,7,8,9,10,11,12};

    //二维数组的长度：
    int length=sizeof(arr1)/sizeof(arr1[0][0]);
    printf("arr1的长度为：%d\n",length);

    //二维数组的遍历：
    for (int i = 0; i < 3; i++)
    {
        for (int j = 0; j < 4; j++)
        {
            printf("%d ",arr1[i][j]);
        }
        printf("\n");
    }
    return 0;
}