/*
算术运算符：
    单目运算符：+、-
    双目运算符：*、/、%（取余，两边为整数）、+、-（左结合性：a/b/c=(a/b)/c）
*/

/*
自增运算符：x++ = ++x = x+1
自减运算符：x-- = --x = x-1
++x --x ：先加1/减1再参与其他运算
x++ x-- ：先参与运算再加1/减1
*/

/*
赋值运算符：=
在赋值运算符前加双目运算符可构成复合运算符（变量 双目运算符=表达式）
*/

/*
关系运算符：>、<、>=、<=、==、!=（结合性：从左向右）
输出真（1）、假（0）
在比较浮点数时，结果不一定准确
*/

/*
逻辑运算符：&&（与）、||（或）、！（非）
输出真（1）、假（0）
优先级：！>&&>||，!高于关系运算符，&&、||低于关系运算符
当多个表达式用&&链接时，若出现一个假，之后的运算都不会进行（尤其注意自增自减运算符）；当多个表达式用||链接时，若出现一个真，之后的运算都不会进行（短路运算）
*/

/*
条件运算符：表达式1？表达式2：表达式3
若表达式1返回真，则以表达式2的结果为最终结果，若表达式1返回假，则以表达式3的结果为最终结果
建议给表达式加小括号增加可读性
*/

/*
逗号运算符：,
*/

/*
运算符优先级：逗号运算符=>赋值运算符=>条件运算符=>逻辑运算符=>位运算符（&、|、^）=>关系运算符=>算术运算符=>特殊运算符（[]、()->()）
*/

/*
结合性从右到左：赋值运算符
*/
#include <stdio.h>
int main() {
    int a = 10;
    int b = 3;
    printf("a + b = %d\n", a + b);
    printf("a - b = %d\n", a - b);
    printf("a * b = %d\n", a * b);
    printf("a / b = %d\n", a / b);
    printf("a %% b = %d\n", a % b);

    int x=10;
    int c1=++x;
    printf("c1=%d,x=%d\n",c1,x);
    int c2=x++;
    printf("c2=%d,x=%d\n",c2,x);
    int c3=--x;
    printf("c3=%d,x=%d\n",c3,x);
    int c4=x--;
    printf("c4=%d,x=%d\n",c4,x);

    int x1=10;
    int z=x1++*++x1;//10*12=120
    printf("%d\n",z);

    int d=5,e=0;
    printf("%d",d>e||d<e++);
    printf("d=%d,e=%d\n",d,e);
    
    double f;
    int w=2,y=1;
    printf("%lf\n",w>y?1:1.5);

    int a1=3,b1=5;
    a1=3*b1,a1*4;//即a1=3*b1（,的运算优先级最低）

    int i=20;
    int n=(i++,i++,i++,i++);//先用后加，故结果为23
    printf("n=%d\n",n);
    return 0;
}