#include <stdio.h>
int main(){
    /*
    在c语言中，若指针p指向数组的一个元素，则p+1指向同一数组的下一个元素
    +1是以数组元素类型长度（偏移量）为一个单位，每次加一个单位（偏移量）
    */
    int a[10]={1,2,3,4,5,6,7,8,9,10};\
    int* p=a;

    //输出数组的某个元素
    printf("%d\n",a[5]);//数组名[索引]
    printf("%d\n",p[5]);//指针[索引]
    printf("%d\n",*(a+5));//*(数组名+索引)
    printf("%d\n",*(p+5));//*(指针+索引)

    //遍历数组
    //方式一:索引
    for (int i = 0; i < 10; i++)
    {
        printf("a[%d]=%d,p[%d]=%d\n",i,a[i],i,p[i]);
    }
    //方式二：索引计算地址
    for (int i = 0; i < 10; i++)
    {
        printf("*(a+%d)=%d,*(p+%d)=%d\n",i,*(a+i),i,*(p+i));
    }
    //方式三：地址直接获取
    for ( p = a; p < (a+10); p++)
    {
        printf("p=%d\n",*p);
    }
    
    return 0;
}